АлогистикТест2/src/Catalogs/РазмерСечения/РазмерСечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РазмерСечения</name>
  <owners>Catalog.КатегорииНоменклатуры</owners>
  <attributes>
    <name>ШиринаММ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТолщинаММ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДиаметрММ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСечения</name>
    <type>
      <types>EnumRef.ВидыСечений</types>
    </type>
  </attributes>
</mdclass:Catalog>

АлогистикТест2/src/Enums/ВидыСечений/ВидыСечений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСечений</name>
  <enumValues>
    <name>Квадратное</name>
  </enumValues>
  <enumValues>
    <name>Круглое</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Catalogs/РазмерСечения/Forms/ФормаЭлемента/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Ключ.Пустая() И Не РольДоступна("алк_Администратор") Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостьюЭлементов();
КонецПроцедуры
	
#КонецОбласти 


#Область СобытияЭлементовФормы

&НаКлиенте
Процедура ВидСеченияПриИзменении(Элемент)
	УправлениеВидимостьюЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ШиринаММПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ТолщинаПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	//Если Объект.Владелец = ПредопределенноеЗначение("Справочник.Номенклатура.ШпонСухой") ИЛИ  
	//	Объект.Владелец = ПредопределенноеЗначение("Справочник.Номенклатура.ШпонКусковой") Тогда
	//	Объект.ВидСечения = ПредопределенноеЗначение("Перечисление.ВидыСечений.Квадратное");
	//ИначеЕсли Объект.Владелец = ПредопределенноеЗначение("Справочник.Номенклатура.Карандаш") Тогда
	//	Объект.ВидСечения = ПредопределенноеЗначение("Перечисление.ВидыСечений.Круглое");
	//КонецЕсли; 
КонецПроцедуры


#КонецОбласти 


#Область Интерфейсные

&НаКлиенте
Процедура УправлениеВидимостьюЭлементов()
	
	Если Объект.ВидСечения = ПредопределенноеЗначение("Перечисление.ВидыСечений.Круглое")  Тогда
		Элементы.ДиаметрММ.Видимость = Истина;
		Элементы.ШиринаММ.Видимость  = Ложь;
		Элементы.ТолщинаММ.Видимость = Ложь;
	ИначеЕсли Объект.ВидСечения = ПредопределенноеЗначение("Перечисление.ВидыСечений.Квадратное") Тогда 
		Элементы.ДиаметрММ.Видимость = Ложь;
		Элементы.ШиринаММ.Видимость  = Истина;
		Элементы.ТолщинаММ.Видимость = Истина;
	Иначе
		Элементы.ДиаметрММ.Видимость = Ложь;
		Элементы.ШиринаММ.Видимость  = Ложь;
		Элементы.ТолщинаММ.Видимость = Ложь;
	КонецЕсли; 
	
КонецПроцедуры
 
	
#КонецОбласти
